## Selecting Rows and Columns

In [165]:
import pandas as pd

In [166]:
#Python Dict to dataframe
people = {
    'first':'arun',
    'last':'r',
    'email': 'arunbalaji25062k@gmail.com',
}
people

{'first': 'arun', 'last': 'r', 'email': 'arunbalaji25062k@gmail.com'}

In [167]:
people = {
    'first': ['arun'],
    'last':['r'],
    'email': ['arunbalaji25062k@gmail.com'],
}
people

{'first': ['arun'], 'last': ['r'], 'email': ['arunbalaji25062k@gmail.com']}

In [168]:
people = {
    'first': ['arun','vijay','kavin','gokul','karthick','arjun','akshay'],
    'last':['balaji','baskar','kumar','kumar','kumar','baskar','balaji'],
    'email': ['arunbalaji25062k@gmail.com','vijay@gmail.com','kavin@gmail.com','gokul@gmail.com','karthick@gmail.com','arjun@gmail.com','akshay@gmail.com'],
}
people

{'first': ['arun', 'vijay', 'kavin', 'gokul', 'karthick', 'arjun', 'akshay'],
 'last': ['balaji', 'baskar', 'kumar', 'kumar', 'kumar', 'baskar', 'balaji'],
 'email': ['arunbalaji25062k@gmail.com',
  'vijay@gmail.com',
  'kavin@gmail.com',
  'gokul@gmail.com',
  'karthick@gmail.com',
  'arjun@gmail.com',
  'akshay@gmail.com']}

In [169]:
df = pd.DataFrame(people)
df

      first    last                       email
0      arun  balaji  arunbalaji25062k@gmail.com
1     vijay  baskar             vijay@gmail.com
2     kavin   kumar             kavin@gmail.com
3     gokul   kumar             gokul@gmail.com
4  karthick   kumar          karthick@gmail.com
5     arjun  baskar             arjun@gmail.com
6    akshay  balaji            akshay@gmail.com

In [170]:
df['email']

0    arunbalaji25062k@gmail.com
1               vijay@gmail.com
2               kavin@gmail.com
3               gokul@gmail.com
4            karthick@gmail.com
5               arjun@gmail.com
6              akshay@gmail.com
Name: email, dtype: object

In [171]:
df.email  #it also returns same (not preferable)

0    arunbalaji25062k@gmail.com
1               vijay@gmail.com
2               kavin@gmail.com
3               gokul@gmail.com
4            karthick@gmail.com
5               arjun@gmail.com
6              akshay@gmail.com
Name: email, dtype: object

In [172]:
type(df['email'])  #series is nothing but rows or columns(1d)

pandas.core.series.Series

In [173]:
#accessing multiple columns
df[['first','email']]

      first                       email
0      arun  arunbalaji25062k@gmail.com
1     vijay             vijay@gmail.com
2     kavin             kavin@gmail.com
3     gokul             gokul@gmail.com
4  karthick          karthick@gmail.com
5     arjun             arjun@gmail.com
6    akshay            akshay@gmail.com

In [174]:
#to get column list
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [175]:
#to access rows 1.loc 2.iloc(interger location)
df.iloc[0]  #to access rows

first                          arun
last                         balaji
email    arunbalaji25062k@gmail.com
Name: 0, dtype: object

In [176]:
#multiple rows
df.iloc[[0,2]]

   first    last                       email
0   arun  balaji  arunbalaji25062k@gmail.com
2  kavin   kumar             kavin@gmail.com

In [177]:
#we can also get the columns using iloc(using interger only)
df.iloc[[0,2],2]

0    arunbalaji25062k@gmail.com
2               kavin@gmail.com
Name: email, dtype: object

In [178]:
#loc (in iloc we accescd using integer)
#in loc we access using label
df

      first    last                       email
0      arun  balaji  arunbalaji25062k@gmail.com
1     vijay  baskar             vijay@gmail.com
2     kavin   kumar             kavin@gmail.com
3     gokul   kumar             gokul@gmail.com
4  karthick   kumar          karthick@gmail.com
5     arjun  baskar             arjun@gmail.com
6    akshay  balaji            akshay@gmail.com

In [179]:
#here first column 0,1,2 first row first,last email are labels
df.loc[0]

first                          arun
last                         balaji
email    arunbalaji25062k@gmail.com
Name: 0, dtype: object

In [180]:
df.loc[[1,0],'first']

1    vijay
0     arun
Name: first, dtype: object

In [181]:
df.loc[[1,0],['first','email']]

   first                       email
1  vijay             vijay@gmail.com
0   arun  arunbalaji25062k@gmail.com

## Indexes

In [182]:
df

      first    last                       email
0      arun  balaji  arunbalaji25062k@gmail.com
1     vijay  baskar             vijay@gmail.com
2     kavin   kumar             kavin@gmail.com
3     gokul   kumar             gokul@gmail.com
4  karthick   kumar          karthick@gmail.com
5     arjun  baskar             arjun@gmail.com
6    akshay  balaji            akshay@gmail.com

In [183]:
#here if we notice email might be unique so to set email as index
df.set_index('email')

                               first    last
email
arunbalaji25062k@gmail.com      arun  balaji
vijay@gmail.com                vijay  baskar
kavin@gmail.com                kavin   kumar
gokul@gmail.com                gokul   kumar
karthick@gmail.com          karthick   kumar
arjun@gmail.com                arjun  baskar
akshay@gmail.com              akshay  balaji

In [184]:
df  #not orignally changed

      first    last                       email
0      arun  balaji  arunbalaji25062k@gmail.com
1     vijay  baskar             vijay@gmail.com
2     kavin   kumar             kavin@gmail.com
3     gokul   kumar             gokul@gmail.com
4  karthick   kumar          karthick@gmail.com
5     arjun  baskar             arjun@gmail.com
6    akshay  balaji            akshay@gmail.com

In [185]:
df.set_index('email',inplace=True)

In [186]:
df  #inplacce=True

                               first    last
email
arunbalaji25062k@gmail.com      arun  balaji
vijay@gmail.com                vijay  baskar
kavin@gmail.com                kavin   kumar
gokul@gmail.com                gokul   kumar
karthick@gmail.com          karthick   kumar
arjun@gmail.com                arjun  baskar
akshay@gmail.com              akshay  balaji

In [187]:
df.loc['vijay@gmail.com']  #here email act as label

first     vijay
last     baskar
Name: vijay@gmail.com, dtype: object

In [188]:
df.loc[['vijay@gmail.com'],['last']]

                   last
email
vijay@gmail.com  baskar

In [189]:
#now we cant able to use int as labels if we use we get type error
# dictToDf.loc[[0]]

df.reset_index(inplace=True)  #to reset index to the way it was

In [190]:
df

                        email     first    last
0  arunbalaji25062k@gmail.com      arun  balaji
1             vijay@gmail.com     vijay  baskar
2             kavin@gmail.com     kavin   kumar
3             gokul@gmail.com     gokul   kumar
4          karthick@gmail.com  karthick   kumar
5             arjun@gmail.com     arjun  baskar
6            akshay@gmail.com    akshay  balaji

## Filtering

In [191]:
df = df[['first','last','email']]
df

      first    last                       email
0      arun  balaji  arunbalaji25062k@gmail.com
1     vijay  baskar             vijay@gmail.com
2     kavin   kumar             kavin@gmail.com
3     gokul   kumar             gokul@gmail.com
4  karthick   kumar          karthick@gmail.com
5     arjun  baskar             arjun@gmail.com
6    akshay  balaji            akshay@gmail.com

In [192]:
df['last']=='kumar'

0    False
1    False
2     True
3     True
4     True
5    False
6    False
Name: last, dtype: bool

In [193]:
filt = df['last']=='balaji'

In [194]:
df[filt]
#dictToDf[dictToDf['last']=='balaji']  it is also possible

    first    last                       email
0    arun  balaji  arunbalaji25062k@gmail.com
6  akshay  balaji            akshay@gmail.com

In [195]:
df.loc[filt,'email']  #i want that filtered email

0    arunbalaji25062k@gmail.com
6              akshay@gmail.com
Name: email, dtype: object

In [196]:
# & and
# | or
filt = ((df['first'] == 'arun') & (df['last'] == 'balaji'))

In [197]:
df.loc[filt,'email']

0    arunbalaji25062k@gmail.com
Name: email, dtype: object

In [198]:
filt = ((df['first']=='arun') | (df['first']=='vijay'))
df[filt]

   first    last                       email
0   arun  balaji  arunbalaji25062k@gmail.com
1  vijay  baskar             vijay@gmail.com

In [199]:
df[~filt]  #tildo provides opposite results

      first    last               email
2     kavin   kumar     kavin@gmail.com
3     gokul   kumar     gokul@gmail.com
4  karthick   kumar  karthick@gmail.com
5     arjun  baskar     arjun@gmail.com
6    akshay  balaji    akshay@gmail.com

## Updating Rows and Columns - Modifying Data Within DataFrames

In [200]:
df = df[['first','last','email']]

In [201]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [209]:
#Updating column names
df.columns = {'First Name','Last Name','E mail'}

In [210]:
df

     E mail First Name                   Last Name
0      arun     balaji  arunbalaji25062k@gmail.com
1     vijay     baskar             vijay@gmail.com
2     kavin      kumar             kavin@gmail.com
3     gokul      kumar             gokul@gmail.com
4  karthick      kumar          karthick@gmail.com
5     arjun     baskar             arjun@gmail.com
6    akshay     balaji            akshay@gmail.com

In [211]:
#Uppercasing using list comprehension
df.columns = {x.upper() for x in df.columns}

In [212]:
df

  FIRST NAME LAST NAME                      E MAIL
0       arun    balaji  arunbalaji25062k@gmail.com
1      vijay    baskar             vijay@gmail.com
2      kavin     kumar             kavin@gmail.com
3      gokul     kumar             gokul@gmail.com
4   karthick     kumar          karthick@gmail.com
5      arjun    baskar             arjun@gmail.com
6     akshay    balaji            akshay@gmail.com

In [213]:
#To replace space with undersccore
df.columns = df.columns.str.replace(' ','_')
df

  FIRST_NAME LAST_NAME                      E_MAIL
0       arun    balaji  arunbalaji25062k@gmail.com
1      vijay    baskar             vijay@gmail.com
2      kavin     kumar             kavin@gmail.com
3      gokul     kumar             gokul@gmail.com
4   karthick     kumar          karthick@gmail.com
5      arjun    baskar             arjun@gmail.com
6     akshay    balaji            akshay@gmail.com

In [217]:
#Now i want to only change certain columns
df.rename(columns = {'FIRST_NAME':'first','LAST_NAME':'last'},inplace=True)
df

      first    last                      E_MAIL
0      arun  balaji  arunbalaji25062k@gmail.com
1     vijay  baskar             vijay@gmail.com
2     kavin   kumar             kavin@gmail.com
3     gokul   kumar             gokul@gmail.com
4  karthick   kumar          karthick@gmail.com
5     arjun  baskar             arjun@gmail.com
6    akshay  balaji            akshay@gmail.com

In [221]:
#Changing rows
df.loc[2] = ['Kamalesh','Kumar','kamalesh@email.com']

In [222]:
df  #observe that kavin changes to kamlesh

      first    last                      E_MAIL
0      arun  balaji  arunbalaji25062k@gmail.com
1     vijay  baskar             vijay@gmail.com
2  Kamalesh   Kumar          kamalesh@email.com
3     gokul   kumar             gokul@gmail.com
4  karthick   kumar          karthick@gmail.com
5     arjun  baskar             arjun@gmail.com
6    akshay  balaji            akshay@gmail.com

In [225]:
#changeing arun's email only
df.loc[0,['last','E_MAIL']] = ['Balaji','arunadhigaaram@gmail.com']

In [226]:
df

      first    last                    E_MAIL
0      arun  Balaji  arunadhigaaram@gmail.com
1     vijay  baskar           vijay@gmail.com
2  Kamalesh   Kumar        kamalesh@email.com
3     gokul   kumar           gokul@gmail.com
4  karthick   kumar        karthick@gmail.com
5     arjun  baskar           arjun@gmail.com
6    akshay  balaji          akshay@gmail.com

In [227]:
df.loc[2,['last']] = 'das'
# df.at[2,['last']] = 'das' .at for single values 
# .loc is preferable

In [228]:
df

      first    last                    E_MAIL
0      arun  Balaji  arunadhigaaram@gmail.com
1     vijay  baskar           vijay@gmail.com
2  Kamalesh     das        kamalesh@email.com
3     gokul   kumar           gokul@gmail.com
4  karthick   kumar        karthick@gmail.com
5     arjun  baskar           arjun@gmail.com
6    akshay  balaji          akshay@gmail.com

In [229]:
#Updating through ffilter
filt = df['first'] == 'arjun'
df[filt]

   first    last           E_MAIL
5  arjun  baskar  arjun@gmail.com

In [230]:
df.loc[filt,'last'] = "Das"

In [231]:
df  #arujun das

      first    last                    E_MAIL
0      arun  Balaji  arunadhigaaram@gmail.com
1     vijay  baskar           vijay@gmail.com
2  Kamalesh     das        kamalesh@email.com
3     gokul   kumar           gokul@gmail.com
4  karthick   kumar        karthick@gmail.com
5     arjun     Das           arjun@gmail.com
6    akshay  balaji          akshay@gmail.com

In [235]:
#converting upper case for first names
df['first'] = df['first'].str.upper()

In [236]:
df

          first    last                    E_MAIL
0          ARUN  Balaji  arunadhigaaram@gmail.com
1         VIJAY  baskar           vijay@gmail.com
2      KAMALESH     das        kamalesh@email.com
3         GOKUL   kumar           gokul@gmail.com
4      KARTHICK   kumar        karthick@gmail.com
5         ARJUN     Das           arjun@gmail.com
6        AKSHAY  balaji          akshay@gmail.com
first       NaN     NaN                       NaN

In [244]:
#droping last n rows
df.drop(df.tail(1).index,inplace=True)

'''
apply
map
applymap
replace
'''
def update_lastname(last):
    return last.upper()

In [246]:
df['last']= df['last'].apply(update_lastname)

In [247]:
df

      first    last                    E_MAIL
0      ARUN  BALAJI  arunadhigaaram@gmail.com
1     VIJAY  BASKAR           vijay@gmail.com
2  KAMALESH     DAS        kamalesh@email.com
3     GOKUL   KUMAR           gokul@gmail.com
4  KARTHICK   KUMAR        karthick@gmail.com
5     ARJUN     DAS           arjun@gmail.com
6    AKSHAY  BALAJI          akshay@gmail.com

In [249]:
df['E_MAIL'].apply(len)

0    24
1    15
2    18
3    15
4    18
5    15
6    16
Name: E_MAIL, dtype: int64

In [250]:
#apply lambda 
df['last'].apply(lambda a:a.lower())

0    balaji
1    baskar
2       das
3     kumar
4     kumar
5       das
6    balaji
Name: last, dtype: object

In [251]:
df.apply(len) #7 rows

first     7
last      7
E_MAIL    7
dtype: int64

In [253]:
df.apply(len,axis='columns')  #3rows

0    3
1    3
2    3
3    3
4    3
5    3
6    3
dtype: int64

In [254]:
df.apply(lambda x:x.min())  #min value in dataframe

first               AKSHAY
last                BALAJI
E_MAIL    akshay@gmail.com
dtype: object

In [255]:
#Applymap is simalar to apply but it runs for each cell
df.applymap(len)

   first  last  E_MAIL
0      4     6      24
1      5     6      15
2      8     3      18
3      5     5      15
4      8     5      18
5      5     3      15
6      6     6      16

In [256]:
df.applymap(lambda x : x.lower())

      first    last                    E_MAIL
0      arun  balaji  arunadhigaaram@gmail.com
1     vijay  baskar           vijay@gmail.com
2  kamalesh     das        kamalesh@email.com
3     gokul   kumar           gokul@gmail.com
4  karthick   kumar        karthick@gmail.com
5     arjun     das           arjun@gmail.com
6    akshay  balaji          akshay@gmail.com

In [262]:
#Map substitude
df['first'].map({'AKSHAY': 'Arun','VIJAY':'Vijay'}) 
# avoid map(because it replace NaN value for nonmatching values))

0      NaN
1    Vijay
2      NaN
3      NaN
4      NaN
5      NaN
6     Arun
Name: first, dtype: object

In [263]:
df['first']= df['first'].replace({
    'ARUN':'Arun',
    'VIJAY':'Vijay',
})

In [264]:
df

      first    last                    E_MAIL
0      Arun  BALAJI  arunadhigaaram@gmail.com
1     Vijay  BASKAR           vijay@gmail.com
2  KAMALESH     DAS        kamalesh@email.com
3     GOKUL   KUMAR           gokul@gmail.com
4  KARTHICK   KUMAR        karthick@gmail.com
5     ARJUN     DAS           arjun@gmail.com
6    AKSHAY  BALAJI          akshay@gmail.com